<template>
  <div class="app-container">
    <h1>卡片笔记</h1>
    <h5>快速记录想法，帮你方便的捕捉灵感，积累知识的复利</h5>
    <el-input
      v-model="textarea"
      type="textarea"
      :rows="4"
      placeholder="请输入内容"
    >
    </el-input>
    <el-button type="success" style="margin: 20px 0">保存笔记</el-button>
    <el-row type="flex" class="row-bg" justify="space-around">
      <el-col v-for="(notebook,index) in notebookList" :key="index" :span="6">
        <el-card class="box-card">
          <p>{{ notebook.content }}</p>
          <el-footer>
            <span>{{ notebook.createTime }}</span>
            <el-divider direction="vertical"></el-divider>
            <span>{{ notebook.author }}</span>
            <el-button icon="el-icon-delete" circle @click="remove(notebook.id)"></el-button>
          </el-footer>
        </el-card>
      </el-col>
    </el-row>

    <span style="text-align: center;display:block;">(有{{ notebookList.length }}条笔记)</span>

  </div>
</template>

<script>
export default {
  name: 'Notebook',
  data() {
    return {
      textarea: '',
      notebookList: [
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者1'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者2'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者1'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者2'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者1'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者2'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者1'
        },
        {
          content: '我前几天就看完整部剧了，晚上十二点左右正好看完，心里百感交集，但更多的是舒了口气。真好啊，大家都有自己的未来。我看完之后是挺轻松的的一个状态，这个结局并没有很悲伤，相反，可以说是一个乐观结局。\n' +
            '\n' +
            '但是这部剧的后劲很大，这几天我总是会想起剧中的一些情节，也因此有了这篇文章。\n' +
            '\n' +
            '先从剧的结尾来看，老年的王响从出租车上下来，进苞米地里解决生理问题后，像是受到了某种东西的感应，在地里兜兜转转的，穿过了穿插在整部剧中的玉米地，走到了马路边，遇到了中年时期正在火车上的自己，对过去的自己说：“别回头，往前看。”\n' +
            '\n' +
            '中年时期的王响回应的是爽朗一笑，在疑惑之后，对应着这句话，往前看，没再回头。\n' +
            '\n' +
            '这个场景和这部剧的开头相对应，中年时期开火车的王响，穿过苞米地，一直往前，而两分钟后的镜头是老年时期的王响在苞米地里解决生理问题，而路边停着的是他自己驾驶的出租车。\n' +
            '\n' +
            '整部剧都看完之后会有一种宿命般的感慨，这些人兜兜转转的回到了原点。不一样的是不是所有人都能回到原点，而回到原点的人也早已不是原来的心境。让观众回想起来之后忍不住叹息，这就是命啊，这就是人生。有些人注定是悲剧，有些人注定要离开。有些人一生抱憾，有些人临终前了却一生的心结。\n' +
            '\n' +
            '网上有很多解析，我想写一点自己的看法。',
          createTime: '2023 5 26  23:40:10',
          author: '作者2'
        }
      ]
    }
  },
  methods: {
    remove(id) {
      console.log(id)
    }
  }
}
</script>

<style lang="less">
.el-row {
  flex-wrap: wrap-reverse;

  &:last-child {
    margin-bottom: 0;
  }
}

.el-col {
  padding: 5px;
  border-radius: 4px;
}

.bg-purple-dark {
  background: #99a9bf;
}

.bg-purple {
  background: #d3dce6;
}

.bg-purple-light {
  background: #e5e9f2;
}

.grid-content {
  border-radius: 4px;
  min-height: 36px;
}
</style>
